const patientData = {
    "allPatients": [
        {
            "pid": "10900016807",
            "dx": "상세불명의 기관지 또는 폐의 악성 신생물",
            "sex": "M",
            "age": "68 years",
            "pod": 0
        },
        {
            "pid": "10900029410",
            "dx": "상세불명의 거미막하출혈",
            "sex": "F",
            "age": "58 years",
            "pod": 0
        },
        {
            "pid": "10900013355",
            "dx": "상세불명의 만성 신장병",
            "sex": "M",
            "age": "66 years",
            "pod": 14
        },
        {
            "pid": "10900005641",
            "dx": "기타 이식된 기관 및 조직의 실패 및 거부",
            "sex": "M",
            "age": "51 years",
            "pod": 11
        },
        {
            "pid": "10900005223",
            "dx": "Unknown",
            "sex": "F",
            "age": "68 years",
            "pod": 1
        },
        {
            "pid": "10900021551",
            "dx": "간세포암종의 악성 신생물",
            "sex": "M",
            "age": "60 years",
            "pod": 5
        },
        {
            "pid": "10900003143",
            "dx": "상세불명의 기관지 또는 폐의 악성 신생물",
            "sex": "F",
            "age": "70 years",
            "pod": 1
        },
        {
            "pid": "10900026441",
            "dx": "위 및 십이지장의 상세불명 질환",
            "sex": "M",
            "age": "74 years",
            "pod": 0
        },
        {
            "pid": "10900008817",
            "dx": "대퇴골 경부의 골절",
            "sex": "M",
            "age": "87 years",
            "pod": 3
        },
        {
            "pid": "10900015778",
            "dx": "상세불명의 기관지 또는 폐의 악성 신생물",
            "sex": "F",
            "age": "72 years",
            "pod": 1
        },
        {
            "pid": "10900008943",
            "dx": "간, 담낭 및 담관의 행동양식 불명 또는 미상의 신생물",
            "sex": "F",
            "age": "65 years",
            "pod": 1
        },
        {
            "pid": "10900003296",
            "dx": "상세불명의 뇌의 악성 신생물",
            "sex": "M",
            "age": "36 years",
            "pod": 11
        },
        {
            "pid": "10900025750",
            "dx": "미만성 뇌손상",
            "sex": "M",
            "age": "58 years",
            "pod": 0
        },
        {
            "pid": "10900015003",
            "dx": "상세불명의 거미막하출혈",
            "sex": "M",
            "age": "39 years",
            "pod": 0
        },
        {
            "pid": "10900009196",
            "dx": "갑상선의 악성 신생물",
            "sex": "F",
            "age": "53 years",
            "pod": 0
        },
        {
            "pid": "10900012141",
            "dx": "경동맥의 폐쇄 및 협착",
            "sex": "M",
            "age": "53 years",
            "pod": 3
        },
        {
            "pid": "10900008811",
            "dx": "파열에 대한 언급이 없는 복부대동맥동맥류",
            "sex": "M",
            "age": "62 years",
            "pod": 3
        },
        {
            "pid": "10900014370",
            "dx": "간세포암종의 악성 신생물",
            "sex": "M",
            "age": "59 years",
            "pod": 43
        },
        {
            "pid": "10900020390",
            "dx": "상세불명의 기관지 또는 폐의 악성 신생물",
            "sex": "F",
            "age": "63 years",
            "pod": 1
        },
        {
            "pid": "10900010081",
            "dx": "파열에 대한 언급이 없는 복부대동맥동맥류",
            "sex": "M",
            "age": "72 years",
            "pod": 9
        },
        {
            "pid": "10900017415",
            "dx": "상세불명의 뇌내출혈",
            "sex": "M",
            "age": "37 years",
            "pod": 0
        },
        {
            "pid": "10900014597",
            "dx": "신장합병증을 동반한 상세불명의 당뇨병",
            "sex": "M",
            "age": "65 years",
            "pod": 3
        },
        {
            "pid": "10900014649",
            "dx": "말기 콩팥(신장)병",
            "sex": "M",
            "age": "24 years",
            "pod": 1
        },
        {
            "pid": "10900012491",
            "dx": "상세불명의 뇌의 악성 신생물",
            "sex": "M",
            "age": "43 years",
            "pod": 4
        },
        {
            "pid": "10900014021",
            "dx": "중대뇌동맥에서 기원한 거미막하출혈",
            "sex": "M",
            "age": "61 years",
            "pod": 6
        },
        {
            "pid": "10900014064",
            "dx": "상세불명의 결장의 악성 신생물",
            "sex": "M",
            "age": "74 years",
            "pod": 8
        },
        {
            "pid": "10900026152",
            "dx": "간내담관암종의 악성 신생물",
            "sex": "M",
            "age": "68 years",
            "pod": 0
        },
        {
            "pid": "10900023843",
            "dx": "상세불명의 기관지 또는 폐의 악성 신생물",
            "sex": "M",
            "age": "74 years",
            "pod": 1
        },
        {
            "pid": "10900017387",
            "dx": "누공이 있는 농흉",
            "sex": "F",
            "age": "56 years",
            "pod": 22
        },
        {
            "pid": "10900031043",
            "dx": "승모판기능부전",
            "sex": "F",
            "age": "73 years",
            "pod": 2
        },
        {
            "pid": "10900041901",
            "dx": "간세포암종의 악성 신생물",
            "sex": "M",
            "age": "56 years",
            "pod": 0
        },
        {
            "pid": "10900019967",
            "dx": "간세포암종의 악성 신생물",
            "sex": "M",
            "age": "52 years",
            "pod": 3
        },
        {
            "pid": "10900032792",
            "dx": "기타 뇌경색증",
            "sex": "M",
            "age": "65 years",
            "pod": 10
        },
        {
            "pid": "10900021922",
            "dx": "척수의 악성 신생물",
            "sex": "F",
            "age": "54 years",
            "pod": 1
        },
        {
            "pid": "10900039082",
            "dx": "상세불명의 거미막하출혈",
            "sex": "F",
            "age": "65 years",
            "pod": 3
        },
        {
            "pid": "10900012864",
            "dx": "상세불명의 수막의 양성 신생물 ",
            "sex": "F",
            "age": "38 years",
            "pod": 1
        },
        {
            "pid": "10900036653",
            "dx": "상세불명의 거미막하출혈",
            "sex": "M",
            "age": "53 years",
            "pod": 0
        },
        {
            "pid": "10900036653",
            "dx": "상세불명의 거미막하출혈",
            "sex": "M",
            "age": "53 years",
            "pod": 0
        },
        {
            "pid": "10900019209",
            "dx": "상세불명의 기관지 또는 폐의 악성 신생물",
            "sex": "M",
            "age": "74 years",
            "pod": 12
        },
        {
            "pid": "10900033436",
            "dx": "기타 거미막하출혈",
            "sex": "M",
            "age": "37 years",
            "pod": -5
        },
        {
            "pid": "10900015357",
            "dx": "태아 및 신생아의 상세불명의 (비외상성) 뇌실내출혈",
            "sex": "F",
            "age": "40 years",
            "pod": 0
        },
        {
            "pid": "10900050848",
            "dx": "위 및 십이지장의 누공",
            "sex": "M",
            "age": "64 years",
            "pod": 91
        },
        {
            "pid": "10900050848",
            "dx": "위 및 십이지장의 누공",
            "sex": "M",
            "age": "64 years",
            "pod": 27
        },
        {
            "pid": "10900050848",
            "dx": "위 및 십이지장의 누공",
            "sex": "M",
            "age": "64 years",
            "pod": 2
        },
        {
            "pid": "10900006375",
            "dx": "횡행결장의 악성 신생물",
            "sex": "F",
            "age": "85 years",
            "pod": 16
        },
        {
            "pid": "10900006375",
            "dx": "횡행결장의 악성 신생물",
            "sex": "F",
            "age": "85 years",
            "pod": 2
        },
        {
            "pid": "10900041646",
            "dx": "기타 두개내손상",
            "sex": "F",
            "age": "62 years",
            "pod": 33
        },
        {
            "pid": "10900041503",
            "dx": "직장구불결장접합부의 악성 신생물",
            "sex": "M",
            "age": "72 years",
            "pod": 12
        },
        {
            "pid": "10900041503",
            "dx": "직장구불결장접합부의 악성 신생물",
            "sex": "M",
            "age": "72 years",
            "pod": 5
        },
        {
            "pid": "10900004644",
            "dx": "Unknown",
            "sex": "F",
            "age": "70 years",
            "pod": 1
        },
        {
            "pid": "10900050078",
            "dx": "식도폐색",
            "sex": "M",
            "age": "31 years",
            "pod": 76
        },
        {
            "pid": "10900050078",
            "dx": "식도폐색",
            "sex": "M",
            "age": "31 years",
            "pod": 12
        },
        {
            "pid": "10900002660",
            "dx": "상세불명의 자궁경부의 악성 신생물",
            "sex": "F",
            "age": "40 years",
            "pod": 1
        },
        {
            "pid": "10900011489",
            "dx": "Unknown",
            "sex": "F",
            "age": "36 years",
            "pod": 1
        },
        {
            "pid": "10900008156",
            "dx": "상세불명의 기관지 또는 폐의 악성 신생물",
            "sex": "M",
            "age": "70 years",
            "pod": 2
        },
        {
            "pid": "10900049975",
            "dx": "간세포암종의 악성 신생물",
            "sex": "F",
            "age": "52 years",
            "pod": 15
        },
        {
            "pid": "10900003157",
            "dx": "상세불명의 폐렴",
            "sex": "F",
            "age": "74 years",
            "pod": 0
        },
        {
            "pid": "10900009816",
            "dx": "상세불명의 바이러스뇌염",
            "sex": "M",
            "age": "39 years",
            "pod": 13
        },
        {
            "pid": "10900046338",
            "dx": "기타 만성 췌장염",
            "sex": "M",
            "age": "39 years",
            "pod": 1
        },
        {
            "pid": "10900011507",
            "dx": "경막외출혈",
            "sex": "F",
            "age": "47 years",
            "pod": 1
        },
        {
            "pid": "10900007058",
            "dx": "기타 흉선의 질환",
            "sex": "F",
            "age": "46 years",
            "pod": 2
        },
        {
            "pid": "10900044198",
            "dx": "간세포암종의 악성 신생물",
            "sex": "M",
            "age": "51 years",
            "pod": 5
        },
        {
            "pid": "10900051395",
            "dx": "파열에 대한 언급이 없는 복부대동맥동맥류",
            "sex": "M",
            "age": "61 years",
            "pod": 5
        },
        {
            "pid": "10900051395",
            "dx": "파열에 대한 언급이 없는 복부대동맥동맥류",
            "sex": "M",
            "age": "61 years",
            "pod": 2
        },
        {
            "pid": "10900002765",
            "dx": "뇌막의 양성 신생물 ",
            "sex": "F",
            "age": "34 years",
            "pod": 6
        },
        {
            "pid": "10900003038",
            "dx": "상세불명의 위의 악성 신생물 ",
            "sex": "M",
            "age": "77 years",
            "pod": 21
        },
        {
            "pid": "10900003038",
            "dx": "상세불명의 위의 악성 신생물 ",
            "sex": "M",
            "age": "77 years",
            "pod": 16
        },
        {
            "pid": "10900045339",
            "dx": "상세불명의 기관지 또는 폐의 악성 신생물",
            "sex": "M",
            "age": "66 years",
            "pod": 1
        },
        {
            "pid": "10900036327",
            "dx": "상세불명의 뇌내출혈",
            "sex": "F",
            "age": "48 years",
            "pod": 4
        },
        {
            "pid": "10900012102",
            "dx": "직장의 악성 신생물",
            "sex": "M",
            "age": "67 years",
            "pod": 14
        },
        {
            "pid": "10900045487",
            "dx": "천막하 뇌의 행동양식 불명 또는 미상의 신생물",
            "sex": "F",
            "age": "18 years",
            "pod": 3
        },
        {
            "pid": "10900050250",
            "dx": "구불결장의 악성 신생물",
            "sex": "M",
            "age": "72 years",
            "pod": 4
        },
        {
            "pid": "10900048827",
            "dx": "상세불명의 거미막하출혈",
            "sex": "M",
            "age": "54 years",
            "pod": 0
        },
        {
            "pid": "10900005259",
            "dx": "상세불명의 식도의 악성 신생물",
            "sex": "M",
            "age": "69 years",
            "pod": 14
        },
        {
            "pid": "10900005259",
            "dx": "상세불명의 식도의 악성 신생물",
            "sex": "M",
            "age": "69 years",
            "pod": 6
        },
        {
            "pid": "10900046051",
            "dx": "상세불명의 기관지 또는 폐의 악성 신생물",
            "sex": "F",
            "age": "69 years",
            "pod": 1
        },
        {
            "pid": "10900033420",
            "dx": "간외담관의 악성 신생물",
            "sex": "F",
            "age": "70 years",
            "pod": 2
        },
        {
            "pid": "10900046498",
            "dx": "상세불명의 만성 신장병",
            "sex": "F",
            "age": "56 years",
            "pod": 2
        },
        {
            "pid": "10900008434",
            "dx": "상세불명의 기관지 또는 폐의 악성 신생물",
            "sex": "F",
            "age": "70 years",
            "pod": 1
        },
        {
            "pid": "10900045921",
            "dx": "뇌신경의 양성 신생물 ",
            "sex": "F",
            "age": "37 years",
            "pod": 1
        },
        {
            "pid": "10900035013",
            "dx": "상세불명의 위의 악성 신생물 ",
            "sex": "M",
            "age": "57 years",
            "pod": 4
        },
        {
            "pid": "10900034518",
            "dx": "상세불명의 뇌의 악성 신생물",
            "sex": "F",
            "age": "48 years",
            "pod": 2
        },
        {
            "pid": "10900049966",
            "dx": "상세불명의 거미막하출혈",
            "sex": "F",
            "age": "70 years",
            "pod": 0
        },
        {
            "pid": "10900005280",
            "dx": "간내담관암종의 악성 신생물",
            "sex": "M",
            "age": "74 years",
            "pod": 25
        },
        {
            "pid": "10900038712",
            "dx": "달리 분류되지 않은 처치에 합병된 출혈 및 혈종",
            "sex": "F",
            "age": "71 years",
            "pod": 12
        },
        {
            "pid": "10900036407",
            "dx": "Unknown",
            "sex": "F",
            "age": "65 years",
            "pod": 1
        },
        {
            "pid": "10900041581",
            "dx": "뇌간의 뇌내출혈",
            "sex": "M",
            "age": "38 years",
            "pod": 0
        },
        {
            "pid": "10900037631",
            "dx": "기타 형태의 협심증",
            "sex": "M",
            "age": "79 years",
            "pod": 3
        },
        {
            "pid": "10900051698",
            "dx": "상세불명의 위의 악성 신생물 ",
            "sex": "M",
            "age": "85 years",
            "pod": 1
        },
        {
            "pid": "10900039421",
            "dx": "두개내 농양 및 육아종",
            "sex": "M",
            "age": "33 years",
            "pod": 1
        },
        {
            "pid": "10900035493",
            "dx": "기타 감염성 척추병증",
            "sex": "M",
            "age": "71 years",
            "pod": 8
        },
        {
            "pid": "10900044647",
            "dx": "전신 및 상세불명의 죽상경화증",
            "sex": "M",
            "age": "72 years",
            "pod": 2
        },
        {
            "pid": "10900012059",
            "dx": "전교통동맥에서 기원한 거미막하출혈",
            "sex": "M",
            "age": "33 years",
            "pod": 0
        },
        {
            "pid": "10900039732",
            "dx": "상세불명의 심장정지",
            "sex": "M",
            "age": "40 years",
            "pod": 0
        },
        {
            "pid": "10900049207",
            "dx": "상세불명의 결장의 악성 신생물",
            "sex": "M",
            "age": "59 years",
            "pod": 22
        },
        {
            "pid": "10900006824",
            "dx": "기타 불명확하고 상세불명의 사망원인",
            "sex": "M",
            "age": "34 years",
            "pod": 0
        },
        {
            "pid": "10900049387",
            "dx": "상세불명의 뇌의 악성 신생물",
            "sex": "F",
            "age": "40 years",
            "pod": 1
        },
        {
            "pid": "10900046811",
            "dx": "중대뇌동맥에서 기원한 거미막하출혈",
            "sex": "M",
            "age": "50 years",
            "pod": 2
        },
        {
            "pid": "10900034328",
            "dx": "미만성 뇌손상",
            "sex": "F",
            "age": "50 years",
            "pod": 0
        },
        {
            "pid": "10900041147",
            "dx": "전신 및 상세불명의 죽상경화증",
            "sex": "M",
            "age": "72 years",
            "pod": 1
        },
        {
            "pid": "10900045515",
            "dx": "상세불명의 거미막하출혈",
            "sex": "F",
            "age": "46 years",
            "pod": 0
        },
        {
            "pid": "10900045515",
            "dx": "상세불명의 거미막하출혈",
            "sex": "F",
            "age": "46 years",
            "pod": -2
        },
        {
            "pid": "10900036885",
            "dx": "불안정협심증",
            "sex": "F",
            "age": "68 years",
            "pod": 8
        },
        {
            "pid": "10900043708",
            "dx": "소뇌의 악성 신생물",
            "sex": "M",
            "age": "22 years",
            "pod": 0
        },
        {
            "pid": "10900085028",
            "dx": "상세불명의 만성 신장병",
            "sex": "F",
            "age": "20 years",
            "pod": 3
        },
        {
            "pid": "10900084322",
            "dx": "혈관종, 모든 부위",
            "sex": "F",
            "age": "18 years",
            "pod": 3
        }
    ],
    "tooltipData": {
        "10900016807": {},
        "10900029410": {},
        "10900013355": {},
        "10900005641": {},
        "10900005223": {},
        "10900021551": {},
        "10900003143": {},
        "10900026441": {},
        "10900008817": {},
        "10900015778": {},
        "10900008943": {},
        "10900003296": {},
        "10900025750": {},
        "10900015003": {},
        "10900009196": {},
        "10900012141": {},
        "10900008811": {},
        "10900014370": {},
        "10900020390": {},
        "10900010081": {},
        "10900017415": {},
        "10900014597": {},
        "10900014649": {},
        "10900012491": {},
        "10900014021": {},
        "10900014064": {},
        "10900026152": {},
        "10900023843": {},
        "10900017387": {},
        "10900031043": {},
        "10900041901": {},
        "10900019967": {},
        "10900032792": {},
        "10900021922": {},
        "10900039082": {},
        "10900012864": {},
        "10900036653": {},
        "10900019209": {},
        "10900033436": {},
        "10900015357": {},
        "10900050848": {},
        "10900006375": {},
        "10900041646": {},
        "10900041503": {},
        "10900004644": {},
        "10900050078": {},
        "10900002660": {},
        "10900011489": {},
        "10900008156": {},
        "10900049975": {},
        "10900003157": {},
        "10900009816": {},
        "10900046338": {},
        "10900011507": {},
        "10900007058": {},
        "10900044198": {},
        "10900051395": {},
        "10900002765": {},
        "10900003038": {},
        "10900045339": {},
        "10900036327": {},
        "10900012102": {},
        "10900045487": {},
        "10900050250": {},
        "10900048827": {},
        "10900005259": {},
        "10900046051": {},
        "10900033420": {},
        "10900046498": {},
        "10900008434": {},
        "10900045921": {},
        "10900035013": {},
        "10900034518": {},
        "10900049966": {},
        "10900005280": {},
        "10900038712": {},
        "10900036407": {},
        "10900041581": {},
        "10900037631": {},
        "10900051698": {},
        "10900039421": {},
        "10900035493": {},
        "10900044647": {},
        "10900012059": {},
        "10900039732": {},
        "10900049207": {},
        "10900006824": {},
        "10900049387": {},
        "10900046811": {},
        "10900034328": {},
        "10900041147": {},
        "10900045515": {},
        "10900036885": {},
        "10900043708": {},
        "10900085028": {},
        "10900084322": {}
    }
};